In [2]:
from sqlalchemy import create_engine
import pymysql 
import pandas as pd 
engine = create_engine('mysql+pymysql://root:12345678@localhost:3306/data_analysis_stack_exchange_movies', echo=False)
table_info = pd.read_sql('show tables', engine)
table_info

  Tables_in_data_analysis_stack_exchange_movies
0                                      Comments
1                                         posts
2                                         Users
3                                         Votes

1. Display the number of votes for each post title

In [3]:
df_number_votes_each_post = pd.read_sql("select p.Title, count(*) 'Number of Votes' from Votes v inner join posts p on v.PostId = p.Id group by v.PostId ", engine)
df_number_votes_each_post

                                                 Title  Number of Votes
0    To what extent were the actors in Wedding Cras...               14
1        Evaluating characters by means of description               10
2    Was the original "Pink Panther" movie intended...                9
3       What does the ending of The Tree of Life mean?               18
4    In The Departed, did the FBI know about the mo...               25
..                                                 ...              ...
567  Why do the robots believe eating Casshern will...                4
568                    How old is Andy in Toy Story 2?                1
569  Does Elastigirl leave her baby in the car by h...                3
570  What is the first movie to show slicing throug...                2
571  What does David pick up off the floor early in...                1

[572 rows x 2 columns]

2. Display posts with comments created by users living in the same location as the post creator

In [4]:
df_post_creator_same_location_comment = pd.read_sql("select p.Title, uf.DisplayName Creator, us.DisplayName Commentor, uf.Location from posts p inner join Comments c on p.Id = c.PostId inner join Users uf on p.OwnerUserId = uf.Id inner join Users us on c.UserId = us.Id where uf.Location = us.Location and uf.Id <> us.Id", engine)
df_post_creator_same_location_comment

,Title,Creator,Commentor,Location
0,Is there more to Gandalf and Galadriel's relat...,johnnyjosefsson,Mario,Sweden
1,What is the Traitor's Motive?,Kyra,Keaanu,Canada
2,Clarification about closing a loop in The Looper,PerfectlyNormal,Gieron,Sweden

3. How many users have never voted ?

In [5]:
df_users_not_voting = pd.read_sql("select DisplayName from Users where Id not in (select distinct(UserId)from Votes)", engine)
df_users_not_voting

        DisplayName
0         Community
1             Fosco
2       Alex Miller
3       System Down
4    Laurent Pireyn
..              ...
350             RPM
351     user1512616
352          Russ C
353       Todd Ries
354           Robyn

[355 rows x 1 columns]

4. Display all posts having the highest amount of comments

In [6]:
df_post_highest_comment = pd.read_sql("with post_comment_rank as (select p.Id, p.Title, count(*) Count, DENSE_RANK() over (order by count(*) desc) comments_rank from posts p inner join Comments c on p.Id = c.PostId group by p.Id) select Id, Title, Count from post_comment_rank where comments_rank = 1", engine)
df_post_highest_comment

     Id                                              Title  Count
0    64  In Iron Man, why is Tony Stark fooled for so l...      5
1   166                           What is Jerusalem worth?      5
2   404                   Who nukes the USA in The Divide?      5
3   515  Plot summaries for the other two movies relate...      5
4  1100     How much money did it take to run "The Sting"?      5
5  1282     Old movie about two pilots and a cheating wife      5
6  1304  How does the budget breakdown for a US TV seas...      5
7  1479                     Aliens took over the satellite      5
8  1750         Why doesn’t Shosanna try to kill Fredrick?      5
9  1771  How do the 'frozen ;ods' survive the banana st...      5

5. For each post, how many votes are coming from users living in Canada ? What’s their percentage of the total number of votes

In [7]:
df_votes_canada_percentage = pd.read_sql('''select p.Id, p.Title, count(*) "Total votes", sum(case when u.Location like "%%Canada%%" then 1 else 0 end) "Votes from Canada", 
cast(sum(case when u.Location like "%%Canada%%" then 1 else 0 end) as float) / cast(count(*) as float) * 100 "Percentage of Canada"
from posts p inner join Votes v on p.Id = v.PostId inner join Users u on v.UserId = u.Id group by p.Id order by count(*) desc ''', engine)
df_votes_canada_percentage

,Id,Title,Total votes,Votes from Canada,Percentage of Canada
0,133,Have there been other candidates to play Jack ...,27,0.0,0.000000
1,13,Where did the speaking-disease come from?,26,1.0,3.846154
2,130,Was Disney's The Black Hole the last film to f...,26,0.0,0.000000
3,5,"In The Departed, did the FBI know about the mo...",25,0.0,0.000000
4,35,Why does Harry only make use of time travel in...,23,1.0,4.347826
...,...,...,...,...,...
567,616,"Is there any credibility to the ""details"" in S...",1,0.0,0.000000
568,486,Who are the Guys in Tall Black Hats in movie '...,1,0.0,0.000000
569,364,Why does she give birth to a dog-headed baby?,1,0.0,0.000000
570,651,How old is Andy in Toy Story 2?,1,0.0,0.000000
571,654,What does David pick up off the floor early in...,1,0.0,0.000000

6. How many hours in average, it takes to the first comment to be posted after a creation of a new post

In [9]:
df_hour_average = pd.read_sql("select avg(time_delta) 'hours in average' from (select p.Title, timestampdiff(hour,p.CreationDate,min(c.CreationDate)) time_delta from posts p inner join Comments c on p.Id = c.PostId group by p.Id) T1", engine)
df_hour_average

   hours in average
0            7.1517

7. Whats the most common post tag ?

In [13]:
df_tags = pd.read_sql("select Tags from posts", engine)
list_tags = df_tags['Tags'].to_list()
lst = []
for el in list_tags:
    str = ''
    for item in el:
        str += item 
        if item == '>':
            lst.append(str)
            str =''
data = {'Tags': lst}
df_new = pd.DataFrame(data)
result = df_new.stack().value_counts().to_dict()
for tag, count in result.items():
    if count == max(result.values()):
        print (f"{tag}: {count}")

<plot-explanation>: 665

8. Create a pivot table displaying how many posts were created for each year (Y axis) and each month (X axis)

In [14]:
df_post_date = pd.read_sql('''select year, sum(case when month = 1 then 1 else 0 end) Jan, 
sum(case when month = 2 then 1 else 0 end) Feb, 
sum(case when month = 3 then 1 else 0 end) Mar, 
sum(case when month = 4 then 1 else 0 end) Apr,
sum(case when month = 5 then 1 else 0 end) May,
sum(case when month = 6 then 1 else 0 end) Jun,
sum(case when month = 7 then 1 else 0 end) Jul,
sum(case when month = 8 then 1 else 0 end) Aug,
sum(case when month = 9 then 1 else 0 end) Sep,
sum(case when month = 10 then 1 else 0 end) Oct,
sum(case when month = 11 then 1 else 0 end) Nov,
sum(case when month = 12 then 1 else 0 end) "Dec"
from (select year(CreationDate) year, month(CreationDate) month from posts) T1 group by year ''', engine)
df_post_date

,year,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,2011,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,15.0,140.0
1,2012,92.0,72.0,62.0,88.0,93.0,105.0,105.0,81.0,60.0,75.0,77.0,155.0
2,2013,129.0,99.0,107.0,92.0,130.0,120.0,134.0,143.0,64.0,0.0,0.0,0.0

9. How many post were made each year?

In [15]:
df_post_each_year = pd.read_sql("select year(CreationDate) year, count(*) 'Number of Posts' from posts group by year(CreationDate)", engine)
df_post_each_year

   year  Number of Posts
0  2011              156
1  2012             1065
2  2013             1018

10. How many votes were made in each day of the week (Sunday, Monday, Tuesday, etc.)?

11. List all comments created on September 19th, 2012

12. List all users under the age of 33, living in London